week5/planets-db/app/controllers/planets_controller.rb

  def create

    # create a new Planet object, all fields blank
    planet = Planet.new

    # populate the fields from the submitted form data in params
    planet.name = params[:name]
    planet.image = params[:image]
    planet.orbit = params[:orbit]
    planet.diameter = params[:diameter]
    planet.mass = params[:mass]
    planet.moons = params[:moons]
    planet.roundness = params[:roundness]

    # the changes to the object above are not saved to the database with .save:
    planet.save
---
INSERT INTO "planets" ("name", "image", "orbit", "diameter", "roundness", "mass", "moons", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    # get the planet we want to edit, so we can prefill the edit form
    @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]

  def update
    # edit form submits to here

    planet = Planet.find params[:id]

    planet.update(
      name: params[:name],
      image: params[:image],
      orbit: params[:orbit],
      diameter: params[:diameter],
      mass: params[:mass],
      moons: params[:moons],
      roundness: params[:roundness]
    )
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
UPDATE "planets" SET "name" = ?, "orbit" = ?, "diameter" = ?, "mass" = ?, "moons" = ?, "roundness" = ?, "updated_at" = ? WHERE "planets"."id" = ?

  def destroy
    Planet.destroy params[:id]
---
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 28]]