week10/burning-airlines/ba-rails-backend/app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights" WHERE "flights"."origin" = $1 AND "flights"."destination" = $2  [["origin", "SYD"], ["destination", "SIN"]]
---
  def search
    flights = Flight.where origin: params[:origin], destination: params[:destination]