week7/ajax-dashboard/app/controllers/messages_controller.rb

INSERT INTO "messages" ("author", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author", "me"], ["content", "lazy bastards"], ["created_at", "2018-02-01 04:30:16.151086"], ["updated_at", "2018-02-01 04:30:16.151086"]]
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save