week10/fruitstore-rails-tdd/app/controllers/fruits_controller.rb

  def index
    @fruits = Fruit.all.reverse
---
SELECT "fruits".* FROM "fruits"

  def create
    fruit = Fruit.create fruit_params
---
INSERT INTO "fruits" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2018-02-22 05:05:39.184189"], ["updated_at", "2018-02-22 05:05:39.184189"], ["name", "Strawberry"]]