week5/tunr-wdi25/app/controllers/users_controller.rb

  def create
    user = User.create user_params
---
INSERT INTO "users" ("email", "name", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"