week5/moma-app/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "nationality", "dob", "period", "image", "roundness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      # form submits here
      Artist.create artist_params

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "artists" SET "name" = ?, "nationality" = ?, "dob" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "Max Ernst TEST"], ["nationality", "German TEST"], ["dob", "1910-11-11"], ["updated_at", "2018-01-17 05:05:01.226592"], ["id", 15]]
---
    def update
      artist = Artist.find params[:id]
      artist.update artist_params

DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 15]]
---
    def destroy
      Artist.destroy params[:id]