week5/moma-app/app/controllers/works_controller.rb

INSERT INTO "works" ("title", "year", "medium", "style", "image", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    # form submits here
    Work.create work_params

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def show
    @work = Work.find params[:id]

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "works" SET "title" = ?, "year" = ?, "medium" = ?, "style" = ?, "updated_at" = ? WHERE "works"."id" = ?  [["title", "Movement TEST"], ["year", "1946 TEST"], ["medium", "oil on canvas TEST"], ["style", "abstract expressionism TEST"], ["updated_at", "2018-01-17 03:33:14.528721"], ["id", 9]]
---
  def update
    work = Work.find params[:id]
    work.update work_params

DELETE FROM "works" WHERE "works"."id" = ?  [["id", 9]]
---
  def destroy
    Work.destroy params[:id]