week5/moma-app/app/views/works/_form.html.erb

SELECT "artists"."name", "artists"."id" FROM "artists"
---
    <%= f.label :artist_id, 'Artist' %>
    <%= f.select :artist_id, Artist.all.pluck(:name, :id), include_blank: true  %>